[
  {
    "context": "A simple move, which destroys Black's plan utterly. Black will now have no concerted action of his pieces, and, as his Pawns are all weak, he will sooner or later lose them."
  },
  {
    "context": "A bad move, which violates one of the principles set down, according to which at least one Knight should be developed before the Bishops are brought out, and also because it exchanges a Bishop for a Knight, which in the opening is generally bad, unless there is some compensation."
  },
  {
    "context": "In this particular ending one should remember that the King must not only be driven to the edge of the board, but also into a corner. In all such endings, however, it is immaterial whether the King is forced {8} on to the last rank, or to an outside file, e.g. K R 5 or Q R 4, K 1 or Q 8."
  },
  {
    "context": "Commenting on White's play in this game, Dr. E. Lasker said at the time that if White's play were properly analysed it might be found that there was no way to improve upon it."
  },
  {
    "context": "In the first case the attack must be carried on with sufficient force to guarantee its success. Under no consideration must a direct attack against the King be carried on _a outrance_ unless there is absolute certainty in one's own mind that it will succeed, since failure in such cases means disaster."
  },
  {
    "context": "EXAMPLE 47.--The student should carefully examine the position, as the sacrifice of the Bishop in similar situations is typical, and the chance for it is of frequent occurrence in actual play. The game continues:"
  },
  {
    "context": "Now comes a little calculation. White can capture the Pawn, but if he does so, he will not, when Queening, command the square where Black will also Queen his Pawn. Therefore, instead of taking, he plays:"
  },
  {
    "context": "A timid move. Black assumes a defensive attitude at once. On principle the move is wrong. In the openings, whenever possible, _pieces should be moved in preference to Pawns_."
  },
  {
    "context": "Now that the K R is in the centre, Black can safely advance, since, in order to attack on the King's side, White would have to shift his Rooks, which he cannot do so long as Black keeps up the pressure in the centre."
  },
  {
    "context": "Once more changing my plan and this time without any good reason. Had I now played R x Kt; P x R ch, R x P; as I intended to do when I went back with the Knight to B 1, I doubt very much if White would have been able to win the game. At least it would have been extremely difficult."
  },
  {
    "context": "The King, a purely _defensive_ piece throughout the middle-game, becomes an _offensive_ piece once all the pieces are off the board, and sometimes even when there are one or two minor pieces left. The handling of the King becomes of paramount importance once the end-game stage is reached."
  },
  {
    "context": "If B x P, P - Q 3; and White's Bishop would be completely shut off, and could only be extricated, if at all, with serious loss of position. The text move aims at quick development to keep the initiative."
  },
  {
    "context": "Before going back to the discussion of openings and middle-game positions, it might be well to bear in mind a few facts concerning Pawn positions which will no doubt help to understand certain moves, and sometimes even the object of certain variations in the openings, and of some manoeuvres in the middle-games."
  },
  {
    "context": "always directly in front of the Pawn, and when it cannot be done, as for instance in this position because of the White King, then the Black King must be kept in front of the White King. The play would proceed thus: 1 P - K 3, K - K 4; 2 K - Q 3, K - Q 4. This is a very important move. Any other move would lose, as will be shown later. As the Black King cannot be kept close up to the Pawn, it must be brought as far forward as possible and, at the same time, in front of the White King."
  },
  {
    "context": "The gain of a Pawn is the smallest material advantage that can be obtained in a game; and it often is sufficient to win, even when the Pawn is the only remaining unit, apart from the Kings. It is essential, speaking generally, that"
  },
  {
    "context": "an indirect way of preventing 5...B x Kt, which more experience or study will show to be bad. At the same time _the Rook is brought into action in the centre, a very important point_. {27}"
  },
  {
    "context": "EXAMPLE 45.--White has a beautiful position, but still he had better gain some material, if he can, before Black consolidates his defensive position. He therefore plays:"
  },
  {
    "context": "Black could have regained the Pawn by playing B x Kt, but he sees that there is more to be had, and therefore increases the pressure against White's Queen side. He now threatens, among other things, R x Kt P."
  },
  {
    "context": "Here it is seen how failure to comply with the elementary logical reasons, that govern any given position, often brings the player into trouble. I was no doubt influenced in my choice of moves by the fear of B - B 5, which was a very threatening move."
  },
  {
    "context": "This gains time by attacking the Rook and holding the White Q at R 3 for the moment, on account of the K Kt P. Besides, the Queen must be in the middle of the fray now that the attack has to be brought home. White has actually more value in material, and therefore Black must utilise everything at his command in order to succeed."
  },
  {
    "context": "EXAMPLE 4.--We now come to Queen and King against King. As the Queen combines the power of the Rook and the Bishop, it is the easiest mate of all and should always be accomplished in under ten moves. Take the following position:"
  },
  {
    "context": "Better would have been P - Q R 4, in order to play B - R 3. The White B would be much better posted on the open diagonal than here, where it acts purely on the defensive."
  },
  {
    "context": "It will be seen that the ending is rather laborious. There are two outstanding features: the close following by the King, and the controlling of the squares of opposite colour to the Bishop by the combined action of the Knight and King. The student would do well to exercise himself methodically in this ending, as it gives a very good idea of the actual power of the pieces, and it requires foresight in order to accomplish the {62} mate within the fifty moves which are granted by the rules."
  },
  {
    "context": "[6] We give, from now on, games and notes, so that the student may familiarise himself with the many and varied considerations that constantly are borne in mind by the Chess Master. We must take it for granted that the student has already reached a stage where, while not being able fully to understand every move, yet he can derive benefit from any discussion with regard to them."
  },
  {
    "context": "He is forced to this in order to avoid the breaking up of his Queen's side Pawns. The only alternative would have been P - Q Kt 4; which on the face of it looks bad."
  },
  {
    "context": "played under the impression that White had to lose time in defending his Q R P, when I could play P - Q B 4, obtaining a very superior game. But, as will be seen, my opponent had quite a little surprise for me."
  },
  {
    "context": "bringing the Rook to attack the King's side Pawns so as to force the King to that side to defend them, and thus indirectly making more secure the position of Black's Queen's side Pawns."
  },
  {
    "context": "In these few examples the attacking has been done by Rooks and Bishops in combination with the Queen. {71} There have been no Knights to take part in the attack. We shall now give some examples in which the Knights play a prominent part as an attacking force."
  },
  {
    "context": "I have purposely given positions without the moves which lead to them so that the student may become accustomed to build up in his own mind possible positions that may arise (out of any given situation). Thus he will learn to make strategical plans and be on his way to the master class. The student can derive enormous benefit by further practice of this kind."
  },
  {
    "context": "White's threat to regain the Pawn was merely with the idea of gaining time to develop his pieces. Black could have played P - Q 3; opening the way for his Q B, when would have followed, 11 B - Q 3, R - K 1; 12 Kt - B 3, and White would soon start a powerful direct attack against Black's King. With the text move Black aims at taking the initiative away from White in accordance with the principles laid down in this book."
  },
  {
    "context": "In the third case, there is nothing to do, once the material advantage is obtained, but to submit to the opponent's attack for a while, and once it has been repulsed to act quickly with all your forces and win on material. A good example of this type of game is given below."
  },
  {
    "context": "The first thing a student should do, is to familiarise himself with the power of the pieces. This can best be done by learning how to accomplish quickly some of the simple mates."
  },
  {
    "context": "Now if 2 K - Q 3, K - Q 2, or if 2 K - K 3, K - K 2, and Black obtains the opposition in both cases. (When the Kings are directly in front of one another, and the number of intervening squares between the Kings is _odd_, the player who has moved last has the opposition.)"
  },
  {
    "context": "The developing stage can now be said to be complete on both sides. The opening is over and the middle-game begins. White, as is generally the case, has {240} obtained the centre. Black, on the other hand, is entrenched in his first three ranks, and if given time will post his Q R at Q B 1 and his Knight at K B 3, and finally play P - Q B 4, in order to break up White's centre and give full action to the Black Bishop posted at Q Kt 2. In this game White attempts to anticipate that plan by initiating an advance on the centre, which, when carefully analysed, is truly an attack against Black's K P."
  },
  {
    "context": "Evidently forced, as the only other move to save a Pawn would have been P x P, which would have left all Black's Pawns isolated and weak. If 8...P - Q 5; 9 R - K 4, K - Q 3; 10 P - Q Kt 4! R - K 4; 11 R - R 6, and Black's game is hopeless."
  },
  {
    "context": "Now White can exercise the option of either playing K - Q 5 and thus passing with his King, or of playing K - B 4 and prevent the Black King from passing, thereby keeping the opposition. Mere counting will show that the former course will only lead to a draw, therefore White takes the latter course and plays:"
  },
  {
    "context": "EXAMPLE 44.--Black's last move was P - K 6, played with the object of stopping what he thought was White's threat, viz.: R - Q R 5, to which he would have answered Q - B 5 ch and drawn the game by perpetual check. White, however, has a more forceful move, and he mates in three moves as follows: {70}"
  },
  {
    "context": "This move has a manifold object. It practically fixes all of Black's Pawns except the Q P, which is the only one that can advance two squares. It specially prevents the advance of Black's K B Pawns, and at the same time"
  },
  {
    "context": "Following our idea that the best way to learn endings as well as openings is to study the games of the masters, we give two more endings of two Rooks and Pawns. These endings, as already stated, are not very common, and the author is fortunate in having himself played more of these endings than is generally the case. By carefully comparing and studying the endings already given (Examples 56 and 57) with the following, the student no doubt can obtain an idea of the proper method to be followed in such cases. The way of procedure is somewhat similar in all of them."
  },
  {
    "context": "First, the complete development of the opening has taken only seven moves. (This varies up to ten or twelve moves in some very exceptional cases. As a rule, eight should be enough.) Second, Black has {28} been compelled to exchange a Bishop for a Knight, but as a compensation he has isolated White's Q R P and doubled a Pawn. (This, at such an early stage of the game, is rather an advantage for White, as the Pawn is doubled towards the centre of the board.) Third, White by the exchange brings up a Pawn to control the square Q 4, puts Black on the defensive, as experience will show, and thus keeps _the initiative_, an unquestionable advantage.[1]"
  },
  {
    "context": "It is evident that Marshall (White) is under great difficulties in the above position. Not only is he bound to lose a Pawn, but his position is rather poor. The best he could hope for was a draw unless something altogether unexpected happened, as it did. No reason can be given for"
  },
  {
    "context": "Up to now White had played with finesse, but this last move is weak. R - R 6 was the proper way to continue, so as to force Black to give up his Q R P or Q B P."
  },
  {
    "context": "The attack increases in force as it is gradually brought home directly against the King. The position now is most interesting and extremely difficult. It is doubtful if there is any valid defence against Black's best play. The variations are numerous and difficult."
  },
  {
    "context": "The alternative was Kt - Q 4. Otherwise White would play Q - R 3, and Black would be forced to play P - K Kt 3 (not P - K R 3, because of the sacrifice B x P), seriously weakening his King's side."
  },
  {
    "context": "Now it would not do to play K - B 7, because Black would play K - Q 3, and White would have to bring back his King to protect the Pawn. Therefore he must continue."
  },
  {
    "context": "The position of White's Knights, especially the one at K 5, might be said to be ideal, and a single glance shows how they dominate the position. The question henceforth will be how is White going to derive the full benefit from such an advantageous situation, This we shall soon see. {154}"
  },
  {
    "context": "This move I considered weak at the time, and I do still. It leaves the K P weak, unless it advances to K 5, and it also makes it possible for Black to pin the Kt by B - Q B 4."
  },
  {
    "context": "In this case one Pawn would hold two of the opponent's Pawns. The student cannot lay too much stress on this principle. It can be applied in many ways, and it constitutes one of the principal weapons in the hands of a master."
  },
  {
    "context": "The fact that out of one apparently simple ending we have been able to work out several most unusual and difficult endings should be sufficient to impress upon the student's mind the necessity of becoming well acquainted with all kinds of endings, and especially with endings of Rook and Pawns."
  },
  {
    "context": "This combination is rather long and has many variations, therefore a beginner will hardly be able to fathom it; but, knowing the type of combination, he might under similar circumstances undertake and carry out a brilliant attack which he would otherwise never think of. It will be seen that all the combinations shown have for a foundation the proper co-ordination of the pieces, which have all been brought to bear against a weak point."
  }
]